{'type': 'D', 'title': '5th - Bhadra 2081, Wednesday, August 21, 2024. Bhadra Krishna Paksha, Dwitiya Tithi. Shatabhisha Nakshatra, Purva Bhadrapada at 6:18 am. Moon sign Aquarius.[Auto Translated by Google]', 'author': 'Deputy Prof. Lakshmi Prasad Baral (Astrologer)', 'lang': 'NP', 'aries': 'The awaited results will arouse enthusiasm . New source of income should be spread. The work done earlier will be of great benefit. Increase in income and amount to be raised at the time of loss. There will be huge benefits in agriculture, animal husbandry and business. You can avail the benefits by using your movable and immovable wealth. You will get a chance to establish a world by doing work that is beneficial for you.', 'taurus': "Today's efforts can bring you prestige in the future. To encourage my fellow brothers to cooperate. Time to create work that impresses others. You can also collect various material resources. Work will be accomplished using intelligence. At the same time, there is disinterest and criticism in not fulfilling the promise. Jealous people can create obstacles in work.", 'gemini': "Almalinuparla, the work which is less beneficial due to circumstances. Even if you think beyond labour, you cannot get value. If you try, you will get good responsibilities. Getting curious about other people's problems can lead to self-inflicted problems. Even during difficult times, those who are spiritually awakened will be inclined towards charitable work. It takes time and hard work to get the job done.", 'cancer': 'It will take time to resolve the situation and complete the task. You will feel weak due to illness. Hard work will yield results even after shouldering the responsibility of challenging work. Well-wishers and competitors bring together the work of Linuparla. Even if the plan is not complete, there will definitely be partial benefits. You will receive positive signals including stopping work.', 'leo': 'Along with achieving the awaited achievement, there will be considerable financial gain. The day will be entertaining. If the absorption is complete then there is a possibility of attaining various material resources. To arouse enthusiasm in learning new knowledge. Possibility of travel for business. The lovely couple will be happy. The bond of love and friendship will tighten. Will receive hospitality.  ', 'virgo': 'Even after getting motivated for success, one has to be very alert about controversies and issues. Remain alert about debts, enemies and diseases. There is a chance for the latter to settle the world by doing special work. You will get various opportunities if you try. Even after hard work, hard work can be achieved to achieve the goal. You will get an opportunity to improve your earlier weaknesses. Some unnecessary expenses may increase. ', 'libra': 'Even if the work takes some time , good news will arouse your enthusiasm. The intellectual field related to study will become wider. Will give you a chance to do prestigious work within a few minutes. There will be profit in business and good profit in agriculture and animal husbandry. The work which will grow stronger with the help of children or followers. Past actions will receive appropriate rewards.', 'scorpio': 'The process may require repeating tasks that are not found. Respected people may find the guidance inappropriate. Any opportunity may be missed due to weak choices. But today is the time to give to others instead of giving to others. The money given may become necessary for oneself later. Get the name and price of Kamle. Special plan should not be made public. The work will be completed within a month.', 'sagittarius': 'If your colleagues step back, your work will be hampered. If the awaited result is weak then some work should be repeated. Karmayoga will progress amidst opportunity and hindrance. With perseverance the situation can be made easier. If you try, you will be able to reap benefits in business. Even if the pressure of work increases, the competition will be successful.', 'capricorn': 'Desire to benefit from studious tendencies. If the influence of speech increases, the art of expression will improve. Money will increase with work. New work proposal may come. The source of income increases at the time of compromise. By using intelligence one can earn knowledge and wealth and within a few months one can get a respectable position.', 'aquarius': 'The first is to increase ambition for success. Various opportunities will also come. Even after taking some tough decisions, my relatives will not stop me. Time will be spent in meeting and eating. The work will be done by gathering allies. If you want a new job offer Our days will grow together. With the support of well-wishers, you will be successful in reaching your goal.', 'pisces': 'Even if there is shortage of money, necessary money will be raised through borrowing or borrowing. Time to try to travel abroad. Had to run around searching for the opportunity. Keep trying again and again and the work will be done. Far away friends will support you in your work. However, if the expenses increase, then you will have to resort to laziness. For the sake of the latter , some thing has to be given up. ', 'todate': '2024-08-21'}